Rolecall_To_Fusion/Rolecall_To_Fusion/Files/RoleCall_FU/Fusion/AR Credit Memo/Create_AR_Memo_Header_Line/Request/Request.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:app1="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/" xmlns:ns1="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/" xmlns:app2="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/types/" xmlns:ns4="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/types/" xmlns:app4="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceHeaderDff/" xmlns:ns3="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceHeaderDff/" xmlns:app3="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionLineInterfaceLineDff/" xmlns:ns2="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionLineInterfaceLineDff/" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<app2:processInterfaceLine>
			<app2:changeOperation>Create</app2:changeOperation>
			<app2:interfaceLine>
				<app1:OrgId>300000002313021</app1:OrgId>
				<app1:BillCustomerAccountNumber>D551184</app1:BillCustomerAccountNumber>
				<app1:BillCustomerSiteNumber>A17571</app1:BillCustomerSiteNumber>
				<app1:BatchSourceName>SIS_AR_IMPORT</app1:BatchSourceName>
				<app1:CurrencyCode>NZD</app1:CurrencyCode>
				<app1:CustomerTrxTypeName>Credit Memo</app1:CustomerTrxTypeName>
				<app1:Description>Test Credit</app1:Description>
				<app1:LineType>LINE</app1:LineType>
				<app1:Quantity>1</app1:Quantity>
				<app1:TrxNumber>11082021_002</app1:TrxNumber>
				<app1:TrxDate>2021-08-03</app1:TrxDate>
				<app1:GlDate>2021-08-03</app1:GlDate>
				<app1:UnitSellingPrice>-80.0000</app1:UnitSellingPrice>
				<app1:AmountIncludesTax>N</app1:AmountIncludesTax>
				<app1:TaxJurisdictionCode>AU GST</app1:TaxJurisdictionCode>
				<app1:Tax>AU GST</app1:Tax>
				<app1:TaxCode>AU_NZ_GST_15%</app1:TaxCode>
				<app1:TaxRegimeCode>AU GST REGIME</app1:TaxRegimeCode>
				<app1:Taxable>Y</app1:Taxable>
				<app1:ReasonCodeMeaning>Goodwill</app1:ReasonCodeMeaning>
				<app1:Comments></app1:Comments>
				<app1:ConversionType>Corporate</app1:ConversionType>
                                <app1:ConversionDate>2021-08-11</app1:ConversionDate>
				<app1:LegalEntityId>300000002335928</app1:LegalEntityId>
				<app1:TransactionInterfaceLineDff xsi:type="app3:Otherinvoicedetails">
					<app3:__FLEX_Context>OtherInvoiceDetails</app3:__FLEX_Context>
					<app3:__FLEX_Context_DisplayValue>OtherInvoiceDetails</app3:__FLEX_Context_DisplayValue>
					<app3:otherinvoicedetails>11082021_002</app3:otherinvoicedetails>
				</app1:TransactionInterfaceLineDff>
				<app1:TransactionInterfaceHeaderDff>
					<app4:batchtrxnumber>0308215823</app4:batchtrxnumber>
                                        <app4:bpayRefNumber>Test</app4:bpayRefNumber>
                                        <app4:poNumber>Test</app4:poNumber>
				</app1:TransactionInterfaceHeaderDff>
			</app2:interfaceLine>
		</app2:processInterfaceLine>
	</soapenv:Body>
</soapenv:Envelope>